{
  "author": "u1hcw9nx",
  "children": [
    {
      "author": "kensai",
      "children": [],
      "created_at": "2026-02-04T10:12:33.000Z",
      "created_at_i": 1770199953,
      "id": 46883923,
      "options": [],
      "parent_id": 46834810,
      "points": null,
      "story_id": 46834810,
      "text": "When you think the article is ending, you get more links for further indulging! Thanks.",
      "title": null,
      "type": "comment",
      "url": null
    },
    {
      "author": "aa-jv",
      "children": [],
      "created_at": "2026-02-04T11:16:40.000Z",
      "created_at_i": 1770203800,
      "id": 46884434,
      "options": [],
      "parent_id": 46834810,
      "points": null,
      "story_id": 46834810,
      "text": "A very nicely written and detailed article, with many details I have not personally learned of, in my own music technology hacking so far .. if anyone else is interested in writing software for musical tuning systems, both Xenharmlib and PyTuning are very extensive libraries for the job .. Xenharmlib for C++ and PyTuning for python.<p>Xenharmlib has deep support for intervals, chords, scales, non-standard notations, and advanced topics like non-Western harmonics, diatonic set theory, and non-octave-repeating systems and also allows for the mathematical manipulation of ratios and structures (harmonic exploration).<p>PyTuning allows for generating scales from ratios&#x2F;cents, EDO, just intonation, and custom temperaments and facilitates calculations such as frequency ratios, comma approximations, and temperament comparisons, aligning with the article&#x27;s derivations and trade-off discussions at a similar depth.<p>I hope to see more math of music articles in the future .. its a fascinating subject indeed!",
      "title": null,
      "type": "comment",
      "url": null
    },
    {
      "author": "uwagar",
      "children": [],
      "created_at": "2026-02-04T11:23:34.000Z",
      "created_at_i": 1770204214,
      "id": 46884492,
      "options": [],
      "parent_id": 46834810,
      "points": null,
      "story_id": 46834810,
      "text": "As we&#x27;ll see, seeking the Pythagorean ideal causes trouble. It will unleash the devil in music.<p>^^ from the article. this kind of thing bothers me. what is the devil? for whom is it the devil? music doesnt havent to be &quot;christian&quot; to &quot;sound good&quot;.",
      "title": null,
      "type": "comment",
      "url": null
    },
    {
      "author": "giraffe_lady",
      "children": [],
      "created_at": "2026-02-04T11:25:33.000Z",
      "created_at_i": 1770204333,
      "id": 46884507,
      "options": [],
      "parent_id": 46834810,
      "points": null,
      "story_id": 46834810,
      "text": "Very cool explanation. Something I&#x27;ve come across a few times on here was wanting to explain how 12tet &quot;includes&quot; or handles approximations of intervals from other scales, and how that affects the musical choices of musicians.<p>But it&#x27;s impossible to explain without getting into like, what is even the problem solved by tuning systems. Without the intuition that comes from making music, programmers and engineers see the fractions &amp; obvious series and get too fixated on finding the &quot;perfect&quot; system. When these are much more physical tools, created over time to make certain processes easier. Tuning systems are more like a woodworker&#x27;s knives than like the unit circle: being perfect does not make them better tools for creation if they are already fit enough.",
      "title": null,
      "type": "comment",
      "url": null
    }
  ],
  "created_at": "2026-01-31T09:04:08.000Z",
  "created_at_i": 1769850248,
  "id": 46834810,
  "options": [],
  "parent_id": null,
  "points": 23,
  "story_id": 46834810,
  "text": null,
  "title": "The Mathematics of Tuning Systems",
  "type": "story",
  "url": "https://math.ucr.edu/home/baez/tuning_talk/"
}